trade_exp/src/Catalogs/ВидыЦенПоставщиков/ВидыЦенПоставщиков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ВидыЦенПоставщиков</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <owners>Checked</owners>
  </extension>
  <owners>Catalog.Партнеры</owners>
  <attributes extendedConfigurationObject="3c2f91fc-45cd-43e2-aa03-0f0e242a13c1">
    <name>Валюта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="10d3d44e-e5fe-448d-bbbc-8dcde99350a8">
    <name>ЦенаВключаетНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="de6c3fd2-3216-4234-a824-1aeeb7c16572">
    <name>ДоступноДляЗакупки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c8697945-c58b-4cef-bbf8-1e8bd9b57e41">
    <name>ДоступноДляПродажиКлиентам</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f8f2e4c9-3ceb-4266-a8c6-a74d7b367b76">
    <name>РеквизитДопУпорядочивания</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="06c0866a-4510-4290-943d-3850b5245d36">
    <name>ГруппаВидовЦен</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e3371f83-b09a-4198-bc28-7a2aed51b386">
    <name>РегионПрисутствия</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="763d01e8-ea69-4acd-b052-c945b77d303c">
    <name>ФорматПодразделения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Catalog>

trade_exp/src/Catalogs/СтруктураПредприятия/СтруктураПредприятия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СтруктураПредприятия</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <hierarchical>Checked</hierarchical>
  </extension>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ТекущийРуководитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИспользоватьСерииНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СкладПоУмолчанию</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СоглашениеСКлиентомПоУмолчанию</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Адрес</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ЦенаПоКарте</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЦенаБезКарты</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СоглашениеСКлиентомЦенаПоКарте</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЦенаЗакупа</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЗонаДоставкиДляВодителя</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СкладАренды</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="bb89859a-43f7-425e-97ba-7a0e687d30b6">
    <name>УправляющийТСК</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="1143b8ac-80af-4e21-a062-8349df19e0af">
    <name>ЗонаДоступа</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="2594f3c1-dcb6-48e9-8ffe-317edbc63278">
    <name>АдминистраторТЗ</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ab17b0c4-c943-4074-87a3-06fa490e3f55">
    <name>ИдентификаторСайта</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>12</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="c680e7c4-b28f-4cf0-b2da-34f5450615d6">
    <name>IDЧатаЛогистов</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>16</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="cd23f242-bb54-4d90-b3e2-4150ed782830">
    <name>ТелефонДиспетчераПоДоставке</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="405c2322-f5fc-4058-ae26-8ed9f144cb75">
    <name>ИдентификаторАстерикс</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="10a23e71-2853-4f12-a914-f5415b6bcef4">
    <name>ВитринаТЗ</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="88a1c539-6866-443c-9456-4e9f4c8dffe8">
    <name>РегионПрисутствия</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="531e77c9-360b-4027-8f1a-6ae098512e5e">
    <name>ФорматПодразделения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="a7f805c4-1704-43e6-bc6c-62a3be8f0cdd">
    <name>ЭквайринговыйТерминалДоставка</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="fd608a6e-c304-4afb-929d-1afc51cf6fcc">
    <name>КассаДоставка</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="abd2adf5-53eb-456b-a1bb-bf7c7f1f0053">
    <name>ПартнерПоУмолчанию</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="12f3a1f4-5035-4ee6-ba44-f1d7e6c7fdeb">
    <name>ИДМагазина</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="d723dd13-1041-4db3-9bfb-99a9a63f8654">
    <name>НомерКонтактногоЦентраПодразделения</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="e123e4bb-41b0-432e-8861-291d47716de8">
    <name>БухгалтерПодразделения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="85eb314b-401a-4568-87d4-4e12cf1a5cbb">
    <name>ПереданВМониторинг</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="16c9ba19-72d3-4d6a-b02c-cdd85c01dd9c">
    <name>СоглашениеДляБригадиров</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0d267d92-46d7-4055-8818-03fe3ef1fb8d">
    <name>СоглашениеДляСотрудников</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5f029caa-d49f-4551-9f1e-32ed5848d041">
    <name>Широта</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>7</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="f0f9c1ca-161b-47df-95f1-94382342aa39">
    <name>Долгота</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>7</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="9a6847d1-30a6-438a-9f21-0d83d7230a78">
    <name>ГрафикРаботы</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Catalog>

trade_exp/src/Catalogs/ВидыЦенПоставщиков/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

&После("ОбработкаПолученияДанныхВыбора")
Процедура Док_ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)

	если Параметры.Отбор.Свойство("ДатаОтбора") и ДопМодуль.НовоеЦенообразованиеЗакупа(Параметры.Отбор.ДатаОтбора) и Параметры.Отбор.Свойство("Подразделение") тогда 
		
		СтандартнаяОбработка = Ложь;
		ДанныеВыбора = Новый СписокЗначений;
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВидыЦенПоставщиков.Ссылка КАК ВидЦен
		|ИЗ
		|	Справочник.ВидыЦенПоставщиков КАК ВидыЦенПоставщиков
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СтруктураПредприятия КАК СтруктураПредприятия
		|		ПО ВидыЦенПоставщиков.РегионПрисутствия = СтруктураПредприятия.РегионПрисутствия
		|			И ВидыЦенПоставщиков.ФорматПодразделения = СтруктураПредприятия.ФорматПодразделения
		|ГДЕ
		|	&ПодстановкаЦенаВключаетНДС
		|	И ВидыЦенПоставщиков.Владелец = &Владелец                      
		|	И СтруктураПредприятия.ссылка = &Подразделение                      
		|	И ВидыЦенПоставщиков.ГруппаВидовЦен = &ГруппаВидовЦен");   
		
		Запрос.УстановитьПараметр("Подразделение", Параметры.Отбор.Подразделение);
		Запрос.УстановитьПараметр("Владелец", Параметры.Отбор.Владелец);
		Запрос.УстановитьПараметр("ГруппаВидовЦен", Параметры.Отбор.ГруппаВидовЦен);
		
		
		// Если в параметрах передан отбор по реквизиту "ЦенаВключаетНДС"
		Если Параметры.Отбор.Свойство("ЦенаВключаетНДС") Тогда
			Запрос.Текст=Стрзаменить(Запрос.Текст,"&ПодстановкаЦенаВключаетНДС","ВидыЦенПоставщиков.ЦенаВключаетНДС = &ЦенаВключаетНДС");
			Запрос.УстановитьПараметр("ЦенаВключаетНДС", Параметры.Отбор.ЦенаВключаетНДС); 
		иначе
			Запрос.Текст=Стрзаменить(Запрос.Текст,"&ПодстановкаЦенаВключаетНДС","истина");
		КонецЕсли;
		
		ДанныеВыбора.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ВидЦен"));
		
		ДанныеВыбора.Добавить(Справочники.ВидыЦен.ПустаяСсылка(), НСтр("ru='<произвольная>'")); 
	конецесли
	
	
КонецПроцедуры
  
#КонецЕсли
